Revit 2017 API
BRepBuilderEdgeGeometry.Create Method (Curve)
 Construct BRepBuilderEdgeGeometry based on any GCurve, including GLine and GArc. The curve will be simplified if possible, and the concrete type of the returned value will reflect that simplification: BRepBuilderLinearEdgeGeometry if the curve could be simplified to a line, BRepBuilderArcEdgeGeometry if it could be simplified to an arc, BRepBuilderGenericCurveEdgeGeometry otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public static BRepBuilderEdgeGeometry Create(
	Curve curve
)
Visual Basic
Public Shared Function Create ( _
	curve As Curve _
) As BRepBuilderEdgeGeometry
Visual C++
public:
static BRepBuilderEdgeGeometry^ Create(
	Curve^ curve
)
Parameters
curve
Type: Autodesk.Revit.DB.Curve
 The 3D curve for this edge. This BRepBuilderEdgeGeometry stores a copy of the input curve.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The curve is degenerate (its length is too close to zero). -or- The endpoints of the curve are close enough that Revit considers it a closed curve. -or- The input curve is not bound.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
BRepBuilderEdgeGeometry Class
Create Overload
Autodesk.Revit.DB Namespace